КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ЗН_Титул4/КонтурЛогистика_ЗН_Титул4.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ЗН_Титул4</name>
  <posting>Deny</posting>
  <attributes>
    <name>УИД_ЗН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументЗН</name>
    <comment>Главный документ для ЗН</comment>
    <type>
      <types>DocumentRef.КонтурЛогистика_ЭлектронныйЗаказНаряд</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИспр</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомИспр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатИнфФщ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрИнфФщ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатФайлИнфФт</name>
    <comment>Дата формирования файла обмена информации Фрахтователя</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрФайлИнфФт</name>
    <comment>Время формирования файла обмена информации Фрахтователя</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдФайлИнфФт</name>
    <comment>Идентификатор файла обмена информации Фрахтователя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭПФт</name>
    <comment>Электронная подпись файла обмена информации Фрахтователя</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатВрЗавПолТС</name>
    <comment>Фактические дата и время завершения пользования транспортным средством</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмДатВрВыпПрвз</name>
    <comment>Изменение даты и времени выполнения перевозки</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмСрокВыпПрвз</name>
    <comment>Изменение сроков выполнения перевозки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзмМршВыпПрвз</name>
    <comment>Изменение маршрута выполнения перевозки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>будет отображаться только в диадоке, не попадет в ЭтРН</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтметкиФрахтовщика</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИВремяОтметки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОбстоятельств</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Акты</name>
    <attributes>
      <name>ИдентификаторСтрокиОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктЭтоАктВзвешивания</name>
      <comment>Если истина - то будет отправелен в СвАктВзв. Если ложь - в СвАкт</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АктНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктИдДок</name>
      <comment>Идентификатор файла документа (в том числе регистрационный номер, если документ / сведения о таком документе содержатся в государственных информационных системах)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктДопСведДок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтороныСоставители</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СтороныСоставители</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйСоставитель</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Штрафы</name>
    <attributes>
      <name>ИдентификаторСтрокиОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактКолЕдИзм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогРазмШтрРФ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчШтр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Информационные поля</comment>
    <attributes>
      <name>ИдентификаторСтрокиОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсправлениеФИОЛиц</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Фамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Это статусы доставки в Диадок. Логистические статусы смотри в спр. КонтурЛогистика_СостоянияДвиженияДокументооборота</comment>
  <enumValues>
    <name>Пропущен</name>
  </enumValues>
  <enumValues>
    <name>Удален</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленКОтправке</name>
  </enumValues>
  <enumValues>
    <name>СформированыФайлыОбмена</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаРаспечатан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаОтказВПодписи</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершена</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
    <comment>для титулов, которые были загружены из Диадока</comment>
  </enumValues>
  <enumValues>
    <name>ПолученТребуетОбработки</name>
  </enumValues>
  <enumValues>
    <name>ПолученОбработанСПредупреждением</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_КатегорииОшибокОбъектов/КонтурЛогистика_КатегорииОшибокОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_КатегорииОшибокОбъектов</name>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаДиадок</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаДругойСтороны</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаКриптографии</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ЭлектронныйЗаказНаряд/КонтурЛогистика_ЭлектронныйЗаказНаряд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ЭлектронныйЗаказНаряд</name>
  <posting>Deny</posting>
  <attributes>
    <name>УИД</name>
    <comment>Уникальный идентификатор, выданный ГИС Минтранса</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗН</name>
    <comment>Должен быть уникальным в пределах Года и Организации</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗН</name>
    <comment>Дата оформления документа.</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фрахтователь</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>Фрахтовщик</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ФрахтовательПодразделение</name>
    <comment>Если требуется особая маршрутизация в Диадоке</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ФрахтовщикПодразделение</name>
    <comment>Если требуется особая маршрутизация в Диадоке</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутДатВрПодТС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПодачи</name>
    <comment>Место подачи ТС</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутМашиночитаемый</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокВыполненияПеревозки</name>
    <comment>СвСрокВыпПрвз</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарииВодителяПриПогрузке</name>
    <comment>для ЗН сейчас не используется из-за отсутствия логики ПЭП водителя в сервисе</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарииВодителяПриВыгрузке</name>
    <comment>для ЗН сейчас не используется из-за отсутствия логики ПЭП водителя в сервисе</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПереадресовок</name>
    <comment>! ТОЛЬКО ДЛЯ СОВМЕСТИМОСТИ СПИСКА ЗАДАЧ! не использовать!</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСменВодителей</name>
    <comment>! ТОЛЬКО ДЛЯ СОВМЕСТИМОСТИ СПИСКА ЗАДАЧ! не использовать!</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСменТС</name>
    <comment>! ТОЛЬКО ДЛЯ СОВМЕСТИМОСТИ СПИСКА ЗАДАЧ! не использовать!</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ЗН_Титул4/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	КонтурЛогистика_ОбработкаДокументовСервер.ОбработкаПолученияПредставленияДокументаТитулаЗН(Данные, Представление, СтандартнаяОбработка, "4");

КонецПроцедуры

// Обязательные манифесты:

Функция МассивОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("ДатВрЗавПолТС");
	
	МассивОбязательных.Добавить("ПользовательПодписант");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

// какие поля могут быть высчитаны из базовых
Функция МассивБазовыхСоответствийРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивДополнительныхРеквизитов() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция МассивДополнительныхРеквизитовТЧ() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция КлючевыеРеквизитыСАвтоматическимЗаполнением() Экспорт
	
	МассивКлючевых = Новый Массив();
	
	МассивКлючевых.Добавить("УИД_ЗН");
	МассивКлючевых.Добавить("ДокументОснование");
	МассивКлючевых.Добавить("ДокументЗН");
	МассивКлючевых.Добавить("СпосПодтПолном");
	МассивКлючевых.Добавить("ТипПодпис");
	МассивКлючевых.Добавить("СтатПодп");
	МассивКлючевых.Добавить("Должность");
	МассивКлючевых.Добавить("Фамилия");
	МассивКлючевых.Добавить("Имя");
	МассивКлючевых.Добавить("Отчество");
	
	МассивКлючевых.Добавить("ДатИнфФщ");
	МассивКлючевых.Добавить("ВрИнфФщ");
	
	МассивКлючевых.Добавить("ДатФайлИнфФт");
	МассивКлючевых.Добавить("ВрФайлИнфФт");
	МассивКлючевых.Добавить("ИдФайлИнфФт");
	МассивКлючевых.Добавить("ЭПФт");
	
	Возврат МассивКлючевых;
	
КонецФункции

Функция ДопРеквизитСтруктура(Имя, Синоним, Комментарий, ТипЗначения, КартинкаИндекс)
	Возврат Новый Структура("Имя, Синоним, Комментарий, Тип, Картинка", Имя, Синоним, Комментарий, ТипЗначения, КартинкаИндекс);	
КонецФункции

// Конец Обязательные манифесты

// Функция - Проверить документ
//
// Параметры:
//  ДокументОбъектИлиСсылка - ДокументСсылка, ДокументОбъект - проверяемый документ может передаваться как ссылкой так и объектом
//  ТаблицаОшибок	 		- ТаблицаЗначений - можно передать таблицу с уже найденными ошибками
//  ПараметрыФормированияФайлов - Структура - Значения реквизитов заполнения файла обмена
// 
// Возвращаемое значение:
//  Структура -  см. КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции()
//
Функция ПроверитьДокумент(Знач ДокументОбъектИлиСсылка, ТаблицаОшибок = Неопределено, ПараметрыФормированияФайлов = Неопределено) Экспорт
	
	Если ТаблицаОшибок = Неопределено Тогда
		ТаблицаОшибок = КонтурЛогистика_ПанельОшибокСервер.ИнициализироватьТаблицуОшибок();
	КонецЕсли;
	
	ТекСтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(ДокументОбъектИлиСсылка.Ссылка, Истина);
	
	ТаблицаОшибок.Очистить();
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		КонтурЛогистика_ПанельОшибокСервер.ВывестиОшибкуТекущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок)
	КонецЕсли;
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен Тогда 
		
		// TODO понять какие сценарии проверки входящего документа
		
	ИначеЕсли Не ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена 
		И Не ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершенаРаспечатан Тогда  
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьДиадокОшибки(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		ПроверитьШапку(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьПодписанта(
			ДокументОбъектИлиСсылка, ТаблицаОшибок,, ПараметрыФормированияФайлов);
		
	КонецЕсли;

	Результат = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьШапку(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ГлавныйДокумент = Объект.ДокументЗН;
	
	Если НЕ ЗначениеЗаполнено(ГлавныйДокумент)  Тогда
		
		ТекстОшибки = "Титул не привязан к Документу Заказ-Наряд";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДокументЗН", КатегорияОшибка, ТекстОшибки, "Указать");
		
	Иначе    
		
		МассивОрганзаций = Новый Массив;
		МассивОрганзаций.Добавить(ГлавныйДокумент.Фрахтователь);
		МассивОрганзаций.Добавить(ГлавныйДокумент.Фрахтовщик);
		
		ОбязательныеРеквизитыГлавного = Документы.КонтурЛогистика_ЭлектронныйЗаказНаряд.МассивОбязательныхРеквизитов();
		
		Для Каждого ОбязательныйРевизит Из ОбязательныеРеквизитыГлавного Цикл
			Если НЕ ЗначениеЗаполнено(ГлавныйДокумент[ОбязательныйРевизит])  Тогда
				
				ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ЭлектронныйЗаказНаряд.СинонимРеквизита(ОбязательныйРевизит);
				ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним + " в Документе электронной транспортной накладной";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ГлавныйДокумент." + ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
		КонецЦикла;
		
		Документы.КонтурЛогистика_ЭлектронныйЗаказНаряд.ПроверитьКлючевыеРеквизиты(ГлавныйДокумент, ТаблицаОшибок);

	КонецЕсли;
	
	Для Каждого ОбязательныйРевизит Из МассивОбязательныхРеквизитов() Цикл
		
		Если Прав(ОбязательныйРевизит, 6) = "Массив" ИЛИ Прав(ОбязательныйРевизит, 14) = "МассивСтруктур" Тогда 
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект[ОбязательныйРевизит]) Тогда
			
			ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ЗН_Титул4.СинонимРеквизита(ОбязательныйРевизит);
			ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним;
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
	КонецЦикла;
	
	// Провдение документа основания
	КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьПроведениеДокументаОснования(Объект, ТаблицаОшибок, КатегорияОшибка);
	
	// TODO
	// ГЛУБОКИЕ ВАЛИДАЦИИ, ВЗАИМНЫЕ ВАЛИДАЦИИ
	
КонецПроцедуры

Функция СинонимРеквизита(ИмяРеквизита) Экспорт

	Попытка
	
		Возврат Метаданные.Документы.КонтурЛогистика_ЗН_Титул4.Реквизиты[ИмяРеквизита].Синоним;
	
	Исключение
		
		//TODO метрику
		Возврат ИмяРеквизита;
		
	КонецПопытки;

КонецФункции

#КонецЕсли
